"""
######################
##                  ##
##  ShadowDarkness  ##
##                  ##
######################"""

# ░░░░░██╗░█████╗░██████╗░██╗░░░██╗██╗░██████╗
# ░░░░░██║██╔══██╗██╔══██╗██║░░░██║██║██╔════╝
# ░░░░░██║███████║██████╔╝╚██╗░██╔╝██║╚█████╗░
# ██╗░░██║██╔══██║██╔══██╗░╚████╔╝░██║░╚═══██╗
# ╚█████╔╝██║░░██║██║░░██║░░╚██╔╝░░██║██████╔╝
# ░╚════╝░╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═╝╚═════╝░

activate_names = ( "джарвис", "джарвиз", "жарвис", "жарвиз", "джой", "жой", "джон", "джервис", 
				   "жервис", "джонни", "джордж", "жордж" )

open_brouser = ( "открой браузер", "запусти браузер" )
open_youtube = ( "открой ютуб", "ютубчик", "ютуб", "открой ютюб", "ютюбчик", "ютюб", "включи ютуб", "включи ютюб" )
# open_youtube2 = ( "открой youtube", "включи youtube" )
open_music = ( "включи музыку", "открой яндекс музыку", "включи музон", "включи музончик" )
open_vk = ( "открой вк", "проверь вк", "чекни вк", "зайди в вк", "зайди во вк", "открой века", "проверь века",
			"чекни века", "зайди в века", "зайди во века", "зайди в и к", "открой языка" )

open_my_playlist = ( "мой плэй лист", "открой мой плейлист", "открой мой плей лист", "мой плейлист", "включи мой плейлист",
				     "включи мою музыку", "моя музыка", "открой мой плэй лист" )

clear_history = ( "очисть историю", "очисти историю", "освободи историю", "удали историю", "очистить историю", "а части историю",
				  "а честь историю" )

jarvis_stupid = ( "ты тупой", "хотя ты тупой", "тупой", "ты идиот", "идиот" )

super_mode_night = ( "уютнее вечер", "уют ми вечер", "уютней вечер", "запусти уютный вечер", "запустить уютный вечер",
	"уютный вечер", "активируй уютный вечер", "запусти уютные вечер", "уютные вечер", "активируй уютные вечера",
	"уютный вечера", "протокол уютная вечер", "протокол уютный вечер", "протокол уютный вечера", "протокол уютные вечера",
	"протокол уютные вечер", "протокола уютные вечер", "протокол уютнее вечер", "протокол уют и вечер" )

super_mode_programming = ( "запусти режим программирования", "активируй режим программирования", "запусти режим программист",
	"активируй режим программист", "программист", "программирование", "программирования" )

shutdown_h = ( "сохранить работу", "сохрани проект и заверши работу", "сохрани состояние", "сохранив состояния", 
	"сохранив состоянии", "сохранить состояние", "сохрания состояния", "сохрани работу", 
	"сохранить состояния", "сохранить состоянии", "сохранить состоянием" )

cancel_event = ( "отмени действие", "отмени последние действие", "отмения последнии действие", "отмена",
	"отмена действия", "отменить" )

sound_stop = ( "остановить музыку", "остановить видео", "останови музыку", "останови видео", "останови звук",
	"пауза", "отмена паузы", "отменить паузу", "восстанови видео", "восстановить видео",
	"восстанови музыку", "восстановить музыку", "восстановить звук", "в останови видео" )

open_full_window = ( "открой на всё окно", "открой на весь экран", "разверни на весь экран" )
swirt_window = ( "сверни окно", "разверни окно", "сверни" )
swirt_windows = ( "сверни окна", "сверни все окна", "верни все окна", "верни окна", "разверни все окна" )
close_window = ( "закрой окно", "закрой программу", "выйди из программы" )

music1 = "TVtgs_3BcJ0"
music2 = "Gj_DAOoDEAw"
music3 = "vV5q0gYlS0o"
music4 = "b4v8Mtbaf9w"
music5 = "rQdIy7gc15w"
music6 = "8_4zR1iOi50"
music7 = "OKn361ftrBM"
music8 = "1Mi9XvrBEj0"

internet_search = ( "найди что такое", "что такое" )

switch_language = ( "смени язык", "смене язык", "поменяй язык", "переключи язык", "переключи на другой язык" )
sub_enter = ( "нажми", "выбери", "выбири", "тыкни" )

input_enter = ( "напиши" )

open_explorer = ( "открой проводник", "запусти проводник" )
open_settings = ( "открой настройки", "запусти настройки" )
open_monitoring = ( "открой диспетчер задач", "запусти диспетчер задач" )

# commands

exit_jarvis = ( "/close", "/exit", "/dc" )
change_color = ( "/color ", "/change_color", "/colour", "/interface", "/theme", "/themes" )